package main

var helpMsg = "💬 Команды:\n" +
	"ℹ Получить это сообщение - /help\n\n" +
	"📅 Получить расписание группы на сегодняшний день (без ассоциации): расписос *номер_группы*\n\n" +
	"📅 Получить расписание группы на завтра (без ассоциации): расписос на завтра *номер_группы*\n\n" +
	"🔗 Создать ассоциацию чата с группой: /bind *номер_группы*\n\n" +
	"📅🔗 Получить расписание группы на сегодняшний день (с ассоциацией): расписос\n\n" +
	"📅🔗 Получить расписание группы на завтра (с ассоциацией): расписос на завтра\n\n" +
	"💬 Информация:\n" +
	"🐛 Информацию об ошибках в работе бота можно присылать сюда: vk.com/topic-208113987_49108488\n\n" +
	"🎙️ Паблик: vk.com/TusurScheduleBot" +
	"\n\nℹВажная информация для людей с буквами в группеℹ:\n при запросе расписания имспользуейте латинские буквы! Прим.: расписос 421-m1"
